Revit 2027 API
ParameterTypeId.PipeRoughness Property
 "Roughness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipeRoughness { get; }
Public Shared ReadOnly Property PipeRoughness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipeRoughness {
	ForgeTypeId^ get ();
}
static member PipeRoughness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace